# Sample Brewfile for Brewfile Analyzer
# This is a comprehensive example showing all supported formats

# Taps - Additional package repositories
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"

# Command-line tools (brew)
brew "git"
brew "node"
brew "python@3.11"
brew "jq"
brew "curl"
brew "wget"
brew "tree"
brew "htop"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "fzf"
brew "tmux"
brew "neovim"
brew "gh"
brew "docker"
brew "kubectl"
brew "terraform"
brew "awscli"
brew "mas"

# Desktop applications (cask)
cask "visual-studio-code"
cask "google-chrome"
cask "firefox"
cask "docker"
cask "postman"
cask "slack"
cask "zoom"
cask "spotify"
cask "1password"
cask "alfred"
cask "raycast"
cask "iterm2"
cask "notion"
cask "figma"

# Mac App Store applications (mas)
mas "Xcode", id: 497799835
mas "Fantastical - Calendar & Tasks", id: 975937182
mas "1Password 7 - Password Manager", id: 1333542190
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
